In [7]:
# imports
import pandas as pd
import numpy as np

In [20]:
# loading filtered data 
ratings = pd.read_csv('Data/title_ratings_filtered.csv')
title_basics = pd.read_csv('Data/title_basics.csv')

## Derming the datatypes and the max length for string/object columns.

### ratings

In [9]:
# Display ratings & info
ratings.head()

      tconst  averageRating  numVotes
0  tt0035423            6.4     87153
1  tt0062336            6.4       175
2  tt0069049            6.7      7754
3  tt0088751            5.2       336
4  tt0096056            5.6       846

In [10]:
ratings.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 71900 entries, 0 to 71899
Data columns (total 3 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   tconst         71900 non-null  object
 1   averageRating  71900 non-null  float64
 2   numVotes       71900 non-null  int64
dtypes: float64(1), int64(1), object(1)
memory usage: 1.6+ MB

In [17]:
# determinig the max length of tconst data
ratings['tconst'].str.len().max()

10

Based on the dtypes of ratings, the  SQL data types will be: 
* INTEGER for numVotes
* FLOAT for averageRating 
* VARCHAR(45) for tconst

### title_basics

In [21]:
# Display title_basics
title_basics.head()

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,runtimeMinutes,genres
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001.0,118,"Comedy,Fantasy,Romance"
1,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El tango del viudo y su espejo deformante,0,2020.0,70,Drama
2,tt0069049,movie,The Other Side of the Wind,The Other Side of the Wind,0,2018.0,122,Drama
3,tt0088751,movie,The Naked Monster,The Naked Monster,0,2005.0,100,"Comedy,Horror,Sci-Fi"
4,tt0096056,movie,Crime and Punishment,Crime and Punishment,0,2002.0,126,Drama

In [22]:
title_basics.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 86979 entries, 0 to 86978
Data columns (total 8 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   tconst          86979 non-null  object
 1   titleType       86979 non-null  object
 2   primaryTitle    86979 non-null  object
 3   originalTitle   86979 non-null  object
 4   isAdult         86979 non-null  int64
 5   startYear       86979 non-null  float64
 6   runtimeMinutes  86979 non-null  int64
 7   genres          86979 non-null  object
dtypes: float64(1), int64(2), object(5)
memory usage: 5.3+ MB

In [24]:
# determinig the max length of tconst data
title_basics['tconst'].str.len().max()

10

In [25]:
# determinig the max length of primaryTitle data
title_basics['primaryTitle'].str.len().max()

242

In [26]:
# converting startyear dtype to integer
title_basics['startYear']= title_basics['startYear'].astype('int')

In [27]:
title_basics['startYear'].dtypes

dtype('int32')

Based on the dtypes of title_basics, the  SQL data types will be: 
* VARCHAR(45) for tconst
* VARCHAR(250) for primarytitle
* INTEGER for startyear
* INTEGER for runtimeMinutes

## Design the Database Model/ERD
![png](movies_ERD.png)

## Create the Database with your CREATE SQL script
this is the [SQL file](movies_create_sql_script.sql)

## Insert Title Basics and Ratings Data with Python

In [32]:
from sqlalchemy.engine import create_engine
import pymysql
pymysql.install_as_MySQLdb()

In [35]:
import json
## getting credentials keys saved in a json file <within a secret folder
with open('/Users/user/.secret/mysql_access.json') as f: 
    login = json.load(f)
login.keys()

dict_keys(['username', 'password'])

In [36]:
# Create connection string using credentials following this format connection = "dialect+driver://username:password@host:port/database"
username = login["username"]
password = login["password"]
db_name = "movies"
connection = f"mysql+pymysql://{username}:{password}@localhost/{db_name}"

In [38]:
# creating the engine 
engine = create_engine(connection)

In [40]:
# create a connection to the engine
conn = engine.connect()

In [42]:
# preview the names of all tables 
q = """ SHOW TABLES;"""
pd.read_sql(q, conn)

   Tables_in_movies
0            genres
1           ratings
2      title_basics
3  title_has_genres

In [43]:
# Showing the description of the genres SQL table
q =''' DESCRIBE genres ; '''
pd.read_sql(q,conn)

        Field         Type Null  Key Default           Extra
0    genre_id          int   NO  PRI    None  auto_increment
1  genre_name  varchar(45)  YES         None

In [46]:
# Showing the description of the title_has_genres SQL table
q =''' DESCRIBE title_has_genres ; '''
pd.read_sql(q,conn)

      Field Type Null  Key Default Extra
0    tconst  int   NO  PRI    None
1  genre_id  int   NO  PRI    None

### Preparing the title_basics DataFrames for the database & inserting data in title_basics SQL table

In [45]:
# Showing the description of the title_basics SQL table
q =''' DESCRIBE title_basics ; '''
pd.read_sql(q,conn)

           Field          Type Null  Key Default Extra
0         tconst   varchar(45)   NO  PRI    None
1  primary_title  varchar(250)  YES         None
2     start_year           int  YES         None
3        runtime           int  YES         None

In [47]:
title_basics.head()

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,runtimeMinutes,genres
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001,118,"Comedy,Fantasy,Romance"
1,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El tango del viudo y su espejo deformante,0,2020,70,Drama
2,tt0069049,movie,The Other Side of the Wind,The Other Side of the Wind,0,2018,122,Drama
3,tt0088751,movie,The Naked Monster,The Naked Monster,0,2005,100,"Comedy,Horror,Sci-Fi"
4,tt0096056,movie,Crime and Punishment,Crime and Punishment,0,2002,126,Drama

In [49]:
# selecting only the columns to append in the SQL table
df_title_basics = title_basics[['tconst', 'primaryTitle', 'startYear', 'runtimeMinutes']]
df_title_basics.head()

,tconst,primaryTitle,startYear,runtimeMinutes
0,tt0035423,Kate & Leopold,2001,118
1,tt0062336,The Tango of the Widower and Its Distorting Mi...,2020,70
2,tt0069049,The Other Side of the Wind,2018,122
3,tt0088751,The Naked Monster,2005,100
4,tt0096056,Crime and Punishment,2002,126

In [50]:
# renaming columns to match title_basics SQL table
col_rename = {'primaryTitle':'primary_title',
              'startYear':'start_year',
              'runtimeMinutes':'runtime'}
df_title_basics = df_title_basics.rename(col_rename, axis = 1)
df_title_basics.head(2)

,tconst,primary_title,start_year,runtime
0,tt0035423,Kate & Leopold,2001,118
1,tt0062336,The Tango of the Widower and Its Distorting Mi...,2020,70

In [51]:
# Saving Data into the title_basics Table
df_title_basics.to_sql("title_basics", conn, index=False, if_exists='append')

86979

In [52]:
# checking the describe again to confirm no changes
q = """DESCRIBE title_basics ;"""
pd.read_sql(q,conn)

           Field          Type Null  Key Default Extra
0         tconst   varchar(45)   NO  PRI    None
1  primary_title  varchar(250)  YES         None
2     start_year           int  YES         None
3        runtime           int  YES         None

### Preparing the ratings DataFrame for the database & inserting data in ratings SQL table

In [44]:
# Showing the description of the ratings SQL table
q =''' DESCRIBE ratings ; '''
pd.read_sql(q,conn)

             Field         Type Null  Key Default Extra
0           tconst  varchar(45)   NO  PRI    None
1   average_rating        float  YES         None
2  number_of_votes          int  YES         None

In [53]:
ratings.head()

      tconst  averageRating  numVotes
0  tt0035423            6.4     87153
1  tt0062336            6.4       175
2  tt0069049            6.7      7754
3  tt0088751            5.2       336
4  tt0096056            5.6       846

In [54]:
# renaming columns to match title_basics SQL table
ratings_col_rename = {'averageRating':'average_rating',
              'numVotes':'number_of_votes'}
ratings = ratings.rename(ratings_col_rename, axis = 1)
ratings.head(2)

      tconst  average_rating  number_of_votes
0  tt0035423             6.4            87153
1  tt0062336             6.4              175

In [55]:
# Saving Data into the ratings Table
ratings.to_sql("ratings", conn, index=False, if_exists='append')

71900

In [56]:
# checking the describe again to confirm no changes in the ratings Table
q = """DESCRIBE ratings ;"""
pd.read_sql(q,conn)

             Field         Type Null  Key Default Extra
0           tconst  varchar(45)   NO  PRI    None
1   average_rating        float  YES         None
2  number_of_votes          int  YES         None

In [57]:
# closing the connection
conn.close()